test-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/spring-soap">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>United Kingdom</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>
